ghi-electronics/TinyCLR-Ports/Targets/STM32F4xx/STM32F4_SD.cpp
    /* Write to SDIO CLKCR */
    SDIO->CLKCR = tmpreg;
}

/**
  * @brief  Enables or disables the SDIO Clock.
  * @param  newState: new state of the SDIO Clock.
  *         This parameter can be: true or false.
  * @retval None
  */
void SDIO_ClockCmd(bool newState) {
    *(uint32_t *)CLKCR_CLKEN_BB = (uint32_t)newState;
}

/**
  * @brief  Sets the power status of the controller.
  * @param  SDIO_PowerState: new state of the Power state.
  *          This parameter can be one of the following values:
  *            @arg SDIO_PowerState_OFF: SDIO Power OFF
  *            @arg SDIO_PowerState_ON: SDIO Power ON
  * @retval None
  */
void SDIO_SetPowerState(uint32_t SDIO_PowerState) {
    SDIO->POWER = SDIO_PowerState;
}

/**
  * @brief  Gets the power status of the controller.
  * @param  None
  * @retval Power status of the controller. The returned value can be one of the
  *         following values:
  *            - 0x00: Power OFF
  *            - 0x02: Power UP
  *            - 0x03: Power ON
  */
uint32_t SDIO_GetPowerState(void) {
    return (SDIO->POWER & (~PWR_PWRCTRL_MASK));
}

/**
  * @}
  */

  /** @defgroup SDIO_Group2 Command path state machine (CPSM) management functions
   *  @brief   Command path state machine (CPSM) management functions
   *
  @verbatim
   ===============================================================================
                Command path state machine (CPSM) management functions
   ===============================================================================

    This section provide functions allowing to program and read the Command path
    state machine (CPSM).

  @endverbatim
    * @{
    */

    /**
      * @brief  Initializes the SDIO Command according to the specified
      *         parameters in the SDIO_CmdInitStruct and send the command.
      * @param  SDIO_CmdInitStruct : pointer to a SDIO_CmdInitTypeDef
      *         structure that contains the configuration information for the SDIO
      *         command.
      * @retval None
      */
void SDIO_SendCommand(uint32_t argument, uint32_t cmdIndex, uint32_t response) {
    uint32_t tmpreg = 0;

    /*---------------------------- SDIO ARG Configuration ------------------------*/
      /* Set the SDIO Argument value */
    SDIO->ARG = argument;

    /*---------------------------- SDIO CMD Configuration ------------------------*/
      /* Get the SDIO CMD value */
    tmpreg = SDIO->CMD;
    /* Clear CMDINDEX, WAITRESP, WAITINT, WAITPEND, CPSMEN bits */
    tmpreg &= CMD_CLEAR_MASK;
    /* Set CMDINDEX bits according to SDIO_CmdIndex value */
    /* Set WAITRESP bits according to SDIO_Response value */
    /* Set WAITINT and WAITPEND bits according to SDIO_Wait value */
    /* Set CPSMEN bits according to SDIO_CPSM value */
    tmpreg |= cmdIndex | response | SDIO_Wait_No | SDIO_CPSM_Enable;

    /* Write to SDIO CMD */
    SDIO->CMD = tmpreg;
}

/**
  * @brief  Returns command index of last command for which response received.
  * @param  None
  * @retval Returns the command index of the last command response received.
  */
uint8_t SDIO_GetCommandResponse(void) {
    return (uint8_t)(SDIO->RESPCMD);
}

/**
  * @brief  Returns response received from the card for the last command.
  * @param  SDIO_RESP: Specifies the SDIO response register.
  *          This parameter can be one of the following values:
  *            @arg SDIO_RESP1: Response Register 1
  *            @arg SDIO_RESP2: Response Register 2
  *            @arg SDIO_RESP3: Response Register 3
  *            @arg SDIO_RESP4: Response Register 4
  * @retval The Corresponding response register value.
  */
uint32_t SDIO_GetResponse(uint32_t SDIO_RESP) {
    uint32_t tmp = 0;

    tmp = SDIO_RESP_ADDR + SDIO_RESP;

    return (*(uint32_t *)tmp);
}

/**
  * @}
  */

  /** @defgroup SDIO_Group3 Data path state machine (DPSM) management functions
   *  @brief   Data path state machine (DPSM) management functions
   *
  @verbatim
   ===============================================================================
                Data path state machine (DPSM) management functions
   ===============================================================================

    This section provide functions allowing to program and read the Data path
    state machine (DPSM).

  @endverbatim
    * @{
    */

    /**
      * @brief  Initializes the SDIO data path according to the specified
      *         parameters in the SDIO_DataInitStruct.
      * @param  SDIO_DataInitStruct : pointer to a SDIO_DataInitTypeDef structure
      *         that contains the configuration information for the SDIO command.
      * @retval None
      */
void SDIO_DataConfig(uint32_t dataLength, uint32_t blockSize, uint32_t transferDir) {
    /*---------------------------- SDIO DTIMER Configuration ---------------------*/
      /* Set the SDIO Data TimeOut value */
    SDIO->DTIMER = SD_DATATIMEOUT;

    /*---------------------------- SDIO DLEN Configuration -----------------------*/
      /* Set the SDIO DataLength value */
    SDIO->DLEN = dataLength;

    /*---------------------------- SDIO DCTRL Configuration ----------------------*/
      /* Get the SDIO DCTRL value */
    uint32_t tmpreg = SDIO->DCTRL;
    /* Clear DEN, DTMODE, DTDIR and DBCKSIZE bits */
    tmpreg &= DCTRL_CLEAR_MASK;
    /* Set DEN bit according to SDIO_DPSM value */
    /* Set DTMODE bit according to SDIO_TransferMode value */
    /* Set DTDIR bit according to SDIO_TransferDir value */
    /* Set DBCKSIZE bits according to SDIO_DataBlockSize value */
    tmpreg |= (uint32_t)blockSize | transferDir | SDIO_TransferMode_Block | SDIO_DPSM_Enable;

    /* Write to SDIO DCTRL */
    SDIO->DCTRL = tmpreg;
}

/**
  * @brief  Returns number of remaining data bytes to be transferred.
  * @param  None
  * @retval Number of remaining data bytes to be transferred
  */
uint32_t SDIO_GetDataCounter(void) {
    return SDIO->DCOUNT;
}

/**
  * @brief  Read one data word from Rx FIFO.
  * @param  None
  * @retval Data received
  */
uint32_t SDIO_ReadData(void) {
    return SDIO->FIFO;
}

/**
  * @brief  Write one data word to Tx FIFO.
  * @param  Data: 32-bit data word to write.
  * @retval None
  */
void SDIO_WriteData(uint32_t Data) {
    SDIO->FIFO = Data;
}

/**
  * @brief  Returns the number of words left to be written to or read from FIFO.
  * @param  None
  * @retval Remaining number of words.
  */
uint32_t SDIO_GetFIFOCount(void) {
    return SDIO->FIFOCNT;
}

/**
  * @}
  */

  /** @defgroup SDIO_Group4 SDIO IO Cards mode management functions
   *  @brief   SDIO IO Cards mode management functions
   *
  @verbatim
   ===============================================================================
                SDIO IO Cards mode management functions
   ===============================================================================

