ghi-electronics/TinyCLR-Ports/Targets/STM32F4xx/STM32F4_SD.cpp
        sdCardStates[i].controllerIndex = i;

        apiManager->Add(apiManager, &sdCardApi[i]);
    }

    apiManager->SetDefaultName(apiManager, TinyCLR_Api_Type::StorageController, sdCardApi[0].Name);
}

TinyCLR_Result STM32F4_SdCard_Acquire(const TinyCLR_Storage_Controller* self) {
    auto state = reinterpret_cast<SdCardState*>(self->ApiInfo->State);

    if (state->initializeCount == 0) {
        auto controllerIndex = state->controllerIndex;

        STM32F4_Gpio_Pin pins[] = { sdCardData0Pins[controllerIndex], sdCardData1Pins[controllerIndex],sdCardData2Pins[controllerIndex], sdCardData3Pins[controllerIndex], sdCardClkPins[controllerIndex], sdCardCmdPins[controllerIndex] };

        for (auto i = 0; i < SIZEOF_ARRAY(pins); i++) {
            if (STM32F4_GpioInternal_OpenPin(pins[i].number))
                STM32F4_GpioInternal_ConfigurePin(pins[i].number, STM32F4_Gpio_PortMode::AlternateFunction, STM32F4_Gpio_OutputType::PushPull, STM32F4_Gpio_OutputSpeed::High, pins[i].number != sdCardClkPins[controllerIndex].number ? STM32F4_Gpio_PullDirection::PullUp : STM32F4_Gpio_PullDirection::None, pins[i].alternateFunction);
            else
                return TinyCLR_Result::SharingViolation;
        }

        RCC->APB2ENR |= (1 << 11);

        auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

        state->regionAddresses = (uint64_t*)memoryProvider->Allocate(memoryProvider, sizeof(uint64_t));
        state->regionSizes = (size_t*)memoryProvider->Allocate(memoryProvider, sizeof(size_t));

        state->descriptor.CanReadDirect = true;
        state->descriptor.CanWriteDirect = true;
        state->descriptor.CanExecuteDirect = false;
        state->descriptor.EraseBeforeWrite = false;
        state->descriptor.Removable = true;
        state->descriptor.RegionsContiguous = false;
        state->descriptor.RegionsEqualSized = false;

        state->descriptor.RegionAddresses = reinterpret_cast<const uint64_t*>(state->regionAddresses);
        state->descriptor.RegionSizes = reinterpret_cast<const size_t*>(state->regionSizes);

        SD_DeInit();

        auto trycount = 3;
    tryinit:
        if (SD_Init() == SD_OK) {
            state->initializeCount++;

            return TinyCLR_Result::Success;
        }
        else {
            if (trycount-- > 0)
                goto tryinit;
        }

        return TinyCLR_Result::InvalidOperation;
    }

    state->initializeCount++;

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_SdCard_Release(const TinyCLR_Storage_Controller* self) {
    auto state = reinterpret_cast<SdCardState*>(self->ApiInfo->State);

    if (state->initializeCount == 0) return TinyCLR_Result::InvalidOperation;

    state->initializeCount--;

    if (state->initializeCount == 0) {
        auto controllerIndex = state->controllerIndex;

        SD_DeInit();

        RCC->APB2ENR &= ~(1 << 11);

        auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

        memoryProvider->Free(memoryProvider, state->regionSizes);
        memoryProvider->Free(memoryProvider, state->regionAddresses);

        uint32_t pins[] = { sdCardData0Pins[controllerIndex].number, sdCardData1Pins[controllerIndex].number,sdCardData2Pins[controllerIndex].number, sdCardData3Pins[controllerIndex].number, sdCardClkPins[controllerIndex].number, sdCardCmdPins[controllerIndex].number };

        for (auto i = 0; i < SIZEOF_ARRAY(pins); i++) {
            STM32F4_GpioInternal_ClosePin(pins[i]);
        }
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_SdCard_Write(const TinyCLR_Storage_Controller* self, uint64_t address, size_t& count, const uint8_t* data, uint64_t timeout) {
    int32_t index = 0;

    int32_t to;

    auto sectorCount = count;

    auto sectorNum = address;

    uint8_t* pData = (uint8_t*)data;

    while (sectorCount) {
        to = timeout;

        while (SD_GetStatus() != SD_TRANSFER_OK && to--) {
            STM32F4_Time_Delay(nullptr, 1);
        }

        if (to > 0 && SD_WriteBlock(&pData[index], sectorNum * STM32F4_SD_SECTOR_SIZE, STM32F4_SD_SECTOR_SIZE) == SD_OK) {
            index += STM32F4_SD_SECTOR_SIZE;
            sectorNum++;
            sectorCount--;
        }
        else {
            SD_StopTransfer();
        }

        if (!to) {
            return TinyCLR_Result::TimedOut;
        }
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_SdCard_Read(const TinyCLR_Storage_Controller* self, uint64_t address, size_t& count, uint8_t* data, uint64_t timeout) {
    int32_t index = 0;

    int32_t to;

    auto sectorCount = count;

    auto sectorNum = address;

    while (sectorCount) {
        to = timeout;

        while (SD_GetStatus() != SD_TRANSFER_OK && to--) {
            STM32F4_Time_Delay(nullptr, 1);
        }

        if (to > 0 && SD_ReadBlock(&data[index], sectorNum * STM32F4_SD_SECTOR_SIZE, STM32F4_SD_SECTOR_SIZE) == SD_OK) {

            index += STM32F4_SD_SECTOR_SIZE;
            sectorNum++;
            sectorCount--;
        }
        else {
            SD_StopTransfer();
        }

        if (!to) {
            return TinyCLR_Result::TimedOut;
        }
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_SdCard_IsErased(const TinyCLR_Storage_Controller* self, uint64_t address, size_t count, bool& erased) {
    erased = true;

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_SdCard_Erases(const TinyCLR_Storage_Controller* self, uint64_t address, size_t& count, uint64_t timeout) {
    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_SdCard_GetDescriptor(const TinyCLR_Storage_Controller* self, const TinyCLR_Storage_Descriptor*& descriptor) {
    auto state = reinterpret_cast<SdCardState*>(self->ApiInfo->State);

    state->regionSizes[0] = STM32F4_SD_SECTOR_SIZE;
    state->descriptor.RegionCount = SDCardInfo.CardCapacity / STM32F4_SD_SECTOR_SIZE;

    descriptor = reinterpret_cast<const TinyCLR_Storage_Descriptor*>(&state->descriptor);

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_SdCard_Open(const TinyCLR_Storage_Controller* self) {
    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_SdCard_Close(const TinyCLR_Storage_Controller* self) {
    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_SdCard_SetPresenceChangedHandler(const TinyCLR_Storage_Controller* self, TinyCLR_Storage_PresenceChangedHandler handler) {
    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_SdCard_IsPresent(const TinyCLR_Storage_Controller* self, bool& present) {
    present = true;

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F4_SdCard_Reset() {
    for (auto i = 0; i < TOTAL_SDCARD_CONTROLLERS; i++) {
        STM32F4_SdCard_Close(&sdCardControllers[i]);
        STM32F4_SdCard_Release(&sdCardControllers[i]);
        sdCardStates[i].initializeCount = 0;
    }

    return TinyCLR_Result::Success;
}
#endif // INCLUDE_SD